#### 📖 Terraform Plan ('infra/resources/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # module.backend_func.azurerm_api_management_api.cdc_v1 will be created
  + resource "azurerm_api_management_api" "cdc_v1" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = (known after apply)
      + description           = "IO CDC PUBLIC API"
      + display_name          = "IO CDC PUBLIC API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-cdc-public-api"
      + path                  = "api/cdc"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = "v1"
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-cdc/refs/heads/main/apps/backend-func/api/internal.yaml"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.backend_func.azurerm_api_management_api_policy.cdc_v1 will be created
  + resource "azurerm_api_management_api_policy" "cdc_v1" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-cdc-public-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <set-backend-service base-url="{{io-cdc-backend-func-kurl}}" />
                    <set-header name="x-functions-key" exists-action="override">
                        <value>{{io-cdc-backend-func-key}}</value>
                    </set-header>
                </inbound>
                <outbound>
                    <base />
                </outbound>
                <backend>
                    <base />
                </backend>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.backend_func.azurerm_api_management_api_version_set.cdc will be created
  + resource "azurerm_api_management_api_version_set" "cdc" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + display_name        = "V1 APIs"
      + id                  = (known after apply)
      + name                = "cdc_v1"
      + resource_group_name = "io-p-itn-common-rg-01"
      + versioning_scheme   = "Segment"
    }

  # module.backend_func.azurerm_api_management_named_value.cdc_backend_func_key will be created
  + resource "azurerm_api_management_named_value" "cdc_backend_func_key" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + display_name        = "io-cdc-backend-func-key"
      + id                  = (known after apply)
      + name                = "io-cdc-backend-func-key"
      + resource_group_name = "io-p-itn-common-rg-01"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.backend_func.azurerm_api_management_named_value.cdc_backend_func_url will be created
  + resource "azurerm_api_management_named_value" "cdc_backend_func_url" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + display_name        = "io-cdc-backend-func-url"
      + id                  = (known after apply)
      + name                = "io-cdc-backend-func-url"
      + resource_group_name = "io-p-itn-common-rg-01"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.backend_func.azurerm_api_management_product.cdc will be created
  + resource "azurerm_api_management_product" "cdc" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + approval_required     = false
      + description           = "Product for IO CDC"
      + display_name          = "IO CDC PUBLIC API"
      + id                    = (known after apply)
      + product_id            = "io-cdc-public-api"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = false
    }

  # module.backend_func.azurerm_api_management_product_api.cdc_v1 will be created
  + resource "azurerm_api_management_product_api" "cdc_v1" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-cdc-public-api"
      + id                  = (known after apply)
      + product_id          = "io-cdc-public-api"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.backend_func.azurerm_api_management_product_policy.cdc will be created
  + resource "azurerm_api_management_product_policy" "cdc" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + id                  = (known after apply)
      + product_id          = "io-cdc-public-api"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.backend_func.module.cdc_backend_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ "COSMOSDB_CDC_URI"                                                                                 = (sensitive value)
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ "REDIS_PORT"                                                                                       = (sensitive value)
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ "REDIS_URL"                                                                                        = (sensitive value)
            # (31 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Web/sites/io-p-itn-cdc-backend-func-01"
        name                                           = "io-p-itn-cdc-backend-func-01"
        tags                                           = {
            "BusinessUnit"   = "CDC"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CDC"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 8 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.storage_fe.module.cdc_storage_fe.azurerm_storage_account.this,
  on .terraform/modules/storage_fe.cdc_storage_fe/storage_account.tf line 2, in resource "azurerm_storage_account" "this":
   2: resource "azurerm_storage_account" "this" {

this block has been deprecated and superseded by the
`azurerm_storage_account_static_website` resource and will be removed in v5.0
of the AzureRM provider

Error: reading Connection String information for Linux Slot (Subscription: "ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-itn-cdc-rg-01"
Site Name: "io-p-itn-cdc-backend-func-01"
Slot Name: "staging"): authorizing request: githubAssertion: cannot request token: Get "https://run-actions-1-azure-eastus.actions.githubusercontent.com/93//idtoken/aafb9acd-f579-488b-8b5b-4171325d86b5/c653ca35-e767-578f-8a41-9c18e41447e5?api-version=2.0&audience=api%3A%2F%2FAzureADTokenExchange": GET https://run-actions-1-azure-eastus.actions.githubusercontent.com/93//idtoken/aafb9acd-f579-488b-8b5b-4171325d86b5/c653ca35-e767-578f-8a41-9c18e41447e5?api-version=2.0&audience=api%3A%2F%2FAzureADTokenExchange giving up after 5 attempt(s)

  with module.backend_func.module.cdc_backend_func.azurerm_linux_function_app_slot.this[0],
  on .terraform/modules/backend_func.cdc_backend_func/function_app_slot.tf line 1, in resource "azurerm_linux_function_app_slot" "this":
   1: resource "azurerm_linux_function_app_slot" "this" {

reading Connection String information for Linux Slot (Subscription:
"ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-itn-cdc-rg-01"
Site Name: "io-p-itn-cdc-backend-func-01"
Slot Name: "staging"): authorizing request: githubAssertion: cannot request
token: Get
"https://run-actions-1-azure-eastus.actions.githubusercontent.com/93//idtoken/aafb9acd-f579-488b-8b5b-4171325d86b5/c653ca35-e767-578f-8a41-9c18e41447e5?api-version=2.0&audience=api%3A%2F%2FAzureADTokenExchange":
GET
https://run-actions-1-azure-eastus.actions.githubusercontent.com/93//idtoken/aafb9acd-f579-488b-8b5b-4171325d86b5/c653ca35-e767-578f-8a41-9c18e41447e5?api-version=2.0&audience=api%3A%2F%2FAzureADTokenExchange
giving up after 5 attempt(s)
::error::Terraform exited with code 1.
```

</details>
